insert into events.roles (id, role)
values (1, 'USER'),
       (2, 'ADMIN');

insert into events.users (id, email, password, username, first_name, last_name)
values  (1, 'admin@spge.bg', '$2a$10$SPws6apVaqMrE1c/pwhYAOx5JdRb4z/q/.fpyLGtSZdb/afxI6L1i', 'ADMIN', 'ADMIN', 'ADMIN');

insert into events.users_roles (user_id, role_id)
values  (1, 1),
        (1, 2);

insert into events.clubs (id, name, organiser)
values (3, 'Моят компютър, моят 3D принтер', 'Димитър Петров Димитров'),
       (4, '3D принтер', 'Димитър Петров Димитров'),
       (5, 'Локални мрежи', 'Димитър Николаев Стоянов'),
       (6, 'Глобални мрежи', 'Димитър Николаев Стоянов'),
       (7, 'Епруветка СПГЕ', 'Невенка Василева Костова'),
       (9, 'Знам и мога - как', 'Златко Кирилов Арсенов'),
       (10, 'Облачни технологии', 'Александър Михайлов Михайлов'),
       (15, '3D моделиране', 'Лъчезар Василев Цветков'),
       (16, 'Разработка на компютърни игри', 'Лъчезар Василев Цветков'),
       (17, 'Роботика с Ардуино', 'Кирил Александров Конов');

insert into events.clubs (id, name, organiser, themes)
values (1, 'Диагностика и ремонт на периферни устройства', 'Цветана Благоева Пунева', 'Диагностика и ремонт на клавиатура. Подмяна на куплунг – USB, захранване или друг; Мишки – видове. Проблеми и дефекти и методи за отстраняването им, Монитори – LCD и TFT; Интерфейси и интерфеисни кабели. Избор и профилактика.'),
       (2, 'Информационна сигурност и защита на личните данни', 'Цветана Благоева Пунева', 'Същност и характеристики на информационна сигурност; Рискове за информацията; Системна сигурност; Защо се  обработват лични данни? Принципи, от които се ръководим и които трябва да спазваме; Политика за защита на личните данни'),
       (8, 'Географски енигми', 'Юлия Радева Симеонова', 'Посещение на Национален Природонаучен музей; Избрани страни от континента Азия: географски, демографски, социален, културен, политически и стопански анализ; Държави от Близкия изток; Държави от Централна Азия'),
       (11, 'Мрежови технологии', 'Александър Михайлов Михайлов', 'Увод в диагностиката и ремонта; Конфигуриране на устройства; OSI модел; DOT модел'),
       (12, 'Интернет технологии', 'Александър Михайлов Михайлов', 'Общи сведения; Топологии на компютърните мрежи; Прoектиране на малка компютърна мрежа; Конфигуриране на безжичи устройства; Защита на безжична мрежа'),
       (13, 'Киберсигурност', 'Румяна Тодорова Николова-Трендафилова', 'Въведение- заплахи и за сигурността на мрежата, атаки; Етично хакерство; Тестване за проникване в мрежата и инструменти; Анализ на уязвимости'),
       (14, 'Управление сигурността на компютърни мрежи', 'Румяна Тодорова Николова-Трендафилова', 'Заплахи за сигурността и принципи на контрол на трафика на КМ; Мрежово администриране; Технологии за сигурност'),
       (18, 'Развий се - личностно и бизнес развитие', 'Виктория Веселинова Димитрова', 'Игровизирано занятие за работа в екип; Как да ползваме социалната мрежа Линкедин за изграждане на автобиография и мрежа от контакти; Участие в трета национална среща между младите и бизнеса; Себепознание и възможности за развитие; Емоционална интелигентност; Критично мислене и формиране на активно гражданско общество; Лична организираност, управление на времето и целеполагане; Социални умения и развитие на умения на бъдещето; Поглед отвътре в бизнес организациите');

